Repository: Carranza32/mbe-app
Catalog: lib/l10n/app_*.arb
Languages: es

# preAlertCompleteAllSteps
source: Please complete all steps before finishing
es: Por favor completa todos los pasos antes de finalizar

# preAlertSelectPaymentMethod
source: Please select a payment method
es: Por favor selecciona un método de pago

# preAlertCompleteError
source: Error completing pre-alert: {error}
es: Error al completar la pre-alerta: {error}

# preAlertCashSuccessMessage
source: Your pre-alert has been completed. Payment will be made at delivery.
es: Tu pre-alerta ha sido completada. El pago se realizará al momento de la entrega.

# preAlertPaymentRegisterError
source: Error registering payment: {error}
es: Error al registrar el pago: {error}

# preAlertUploadTransferProof
source: You must upload the transfer receipt
es: Debes subir el comprobante de transferencia

# preAlertTransferReceivedMessage
source: We have received your transfer receipt (ref: {ref}). The team will verify the payment and your pre-alert will be confirmed.
es: Hemos recibido tu comprobante de transferencia (ref: {ref}). El equipo verificará el pago y tu pre-alerta quedará confirmada.

# preAlertTransferSendError
source: Error sending receipt: {error}
es: Error al enviar el comprobante: {error}

# preAlertPaymentInitError
source: Error initiating payment: {error}
es: Error al iniciar el pago: {error}

# preAlertPaymentSuccessMessage
source: Your payment has been processed successfully. The pre-alert has been completed.
es: Tu pago se ha procesado correctamente. La pre-alerta ha sido completada exitosamente.

# preAlertPaymentFailedMessage
source: Payment could not be completed. If you made the payment, the team will verify it.
es: El pago no se pudo completar. Si realizaste el pago, el equipo lo verificará.

# preAlertPaymentSuccessTitle
source: Payment Successful!
es: ¡Pago Exitoso!

# preAlertPaymentErrorTitle
source: Payment Error
es: Error en el Pago

# preAlertPaymentCancelled
source: Payment Cancelled
es: Pago Cancelado

# preAlertPaymentCancelledMessage
source: Payment was cancelled. You can try again.
es: El pago fue cancelado. Puedes intentar nuevamente.

# preAlertBack
source: Back
es: Atrás

# preAlertContinue
source: Continue
es: Continuar

# preAlertFinish
source: Finish
es: Finalizar

# preAlertFrom
source: From
es: Desde

# preAlertNoAdditionalCost
source: No additional cost
es: Sin costo adicional

# preAlertPickupInStore
source: Pick up in Store
es: Recoger en Tienda

# preAlertPickupDescription
source: Pick up your package at any of our locations
es: Recoge tu paquete en cualquiera de nuestras ubicaciones

# preAlertHomeDelivery
source: Home Delivery
es: Envío a Domicilio

# preAlertDeliveryDescription
source: Receive your order at your door
es: Recibe tu pedido en la puerta de tu casa u oficina

# preAlertSelectStoreTitle
source: Select a store
es: Selecciona una tienda

# preAlertSelectAddress
source: Select an address
es: Selecciona una dirección

# preAlertNoStores
source: No stores available
es: No hay tiendas disponibles

# preAlertErrorLoadingStores
source: Error loading stores
es: Error al cargar tiendas

# preAlertErrorLoadingAddresses
source: Error loading addresses
es: Error al cargar direcciones

# preAlertNoAddresses
source: You have no saved addresses
es: No tienes direcciones guardadas

# preAlertAddAddress
source: Add address
es: Agregar dirección

# preAlertNewAddress
source: New address
es: Nueva dirección

# preAlertDefault
source: Default
es: Predeterminada

# preAlertBaseCost
source: Base cost
es: Costo base

# preAlertEstimatedTime
source: Estimated time
es: Tiempo estimado

# preAlertEstimatedTimeValue
source: 1-2 business days
es: 1-2 días hábiles

# preAlertSaveAmount
source: You save {amount}
es: Ahorras {amount}

# preAlertContactInfoTitle
source: Contact Information
es: Información de Contacto

# preAlertContactInfoSubtitle
source: Provide your contact details
es: Proporciona tus datos de contacto

# preAlertFullName
source: Full name
es: Nombre completo

# preAlertFullNameHint
source: Enter your full name
es: Ingresa tu nombre completo

# preAlertEmailLabel
source: Email
es: Correo electrónico

# preAlertEmailHint
source: email@example.com
es: correo@ejemplo.com

# preAlertPhoneLabel
source: Phone
es: Teléfono

# preAlertNotesOptional
source: Additional notes (optional)
es: Notas adicionales (opcional)

# preAlertNotesHint
source: e.g. Call before pickup, preferred time...
es: Ej: Llamar antes de recoger, horario preferido...

# preAlertDifferentReceiver
source: Is the receiver different?
es: ¿El receptor es diferente?

# preAlertDifferentReceiverDesc
source: Check this option if someone else will receive the package
es: Marca esta opción si otra persona recibirá el paquete

# preAlertReceiverInfo
source: Receiver Information
es: Información del Receptor

# preAlertReceiverName
source: Receiver name
es: Nombre del receptor

# preAlertReceiverNameHint
source: Receiver full name
es: Nombre completo del receptor

# preAlertReceiverEmail
source: Receiver email
es: Correo del receptor

# preAlertReceiverPhone
source: Receiver phone
es: Teléfono del receptor

# preAlertPaymentInfo
source: Payment Information
es: Información de Pago

# preAlertPaymentInfoSubtitle
source: Complete payment details
es: Completa los datos de pago

# preAlertTotalToPay
source: Total to pay
es: Total a pagar

# preAlertPaymentMethod
source: Payment method
es: Método de pago

# preAlertBankTransfer
source: Bank transfer
es: Transferencia bancaria

# preAlertBankTransferDesc
source: Upload transfer receipt (image or PDF). It will be reviewed by the team.
es: Sube el comprobante de transferencia (imagen o PDF). Será revisado por el equipo.

# preAlertCashOnDelivery
source: Cash (on delivery)
es: Efectivo (contra entrega)

# preAlertCashOnDeliveryDesc
source: Pay in cash when you receive your package.
es: Paga en efectivo al momento de recibir tu paquete.

# preAlertTransferProof
source: Transfer receipt
es: Comprobante de transferencia

# preAlertSelectImageOrPdf
source: Select image or PDF
es: Seleccionar imagen o PDF

# preAlertProofSelected
source: Receipt selected
es: Comprobante seleccionado

# preAlertBankReferenceOptional
source: Bank reference (optional)
es: Referencia bancaria (opcional)

# preAlertNotesOptionalLabel
source: Notes (optional)
es: Notas (opcional)

# preAlertCashPaymentInfo
source: Payment will be made at the time of delivery of your package.
es: El pago se realizará al momento de la entrega de tu paquete.

# preAlertAutocompleteAI
source: AI Autocomplete
es: Autocompletar con IA

# preAlertAutocompleteAIDesc
source: Upload your invoice (PDF or image) and AI will fill out the form for you. The same file will be sent with the pre-alert.
es: Sube tu factura (PDF o imagen) y la IA rellenará el formulario por ti. El mismo archivo se enviará con la prealerta.

# preAlertChange
source: Change
es: Cambiar

# preAlertUploadFile
source: Upload file
es: Subir archivo

# preAlertAnalyzing
source: Analyzing with AI...
es: Analizando con IA...

# preAlertReadingInvoice
source: AI is reading your invoice
es: La IA está leyendo tu factura

# preAlertFileTooLarge
source: File cannot exceed 10 MB
es: El archivo no puede superar los 10 MB

# preAlertErrorSelecting
source: Error selecting: {error}
es: Error al seleccionar: {error}

# preAlertProductItem
source: Product {index}
es: Producto {index}

# preAlertProductCategory
source: Product Category
es: Categoría del Producto

# preAlertSelectCategory
source: Select or search a category...
es: Selecciona o busca una categoría...

# preAlertSearchCategory
source: Search category...
es: Buscar categoría...

# preAlertQuantity
source: Quantity
es: Cantidad

# preAlertPrice
source: Price
es: Precio

# preAlertPromotionsAvailable
source: Available Promotions
es: Promociones Disponibles

# preAlertPromotionsSubtitle
source: Take advantage of our special offers
es: Aprovecha nuestras ofertas especiales

# preAlertNoPromotions
source: No promotions available at this time
es: No hay promociones disponibles en este momento

# preAlertSelectDeliveryFirst
source: Please select a delivery method first
es: Por favor selecciona un método de entrega primero

# preAlertErrorLoadingPromotion
source: Error loading promotion: {error}
es: Error al cargar promoción: {error}

# preAlertClose
source: Close
es: Cerrar

# preAlertPromotion
source: PROMOTION
es: PROMOCIÓN

# preAlertEstimatedSavings
source: Estimated savings
es: Ahorro estimado

# preAlertProcessingPayment
source: Processing Payment
es: Procesando Pago

# preAlertLoadingPaymentForm
source: Loading payment form...
es: Cargando formulario de pago...

# preAlertErrorLoadingPage
source: Error loading page: {error}
es: Error al cargar la página: {error}

# preAlertNoAddressFallback
source: No address
es: Sin dirección

# printOrderCreateTitle
source: Create order
es: Crear pedido

# printOrderMyOrders
source: My Orders
es: Mis Pedidos

# printOrderNewOrder
source: New Order
es: Nuevo Pedido

# printOrderSaveDraft
source: Save draft
es: Guardar borrador

# printOrderResetOrder
source: Reset order
es: Reiniciar pedido

# printOrderHelp
source: Help
es: Ayuda

# printOrderCreatedSuccess
source: Order created!
es: ¡Pedido creado!

# printOrderCreatedMessage
source: Your order has been created successfully
es: Tu pedido ha sido creado exitosamente

# printOrderCreateError
source: Error creating order
es: Error al crear el pedido

# printOrderUnexpectedError
source: Unexpected error: {error}
es: Error inesperado: {error}

# printOrderNoOrders
source: You have no orders
es: No tienes pedidos

# printOrderCreateFirst
source: Create your first print order
es: Crea tu primer pedido de impresión

# printOrderDetailTitle
source: Order Detail
es: Detalle del Pedido

# printOrderHistory
source: History
es: Historial

# printOrderConfig
source: Configuration
es: Configuración

# printOrderFiles
source: Files
es: Archivos

# printOrderPages
source: Pages
es: Páginas

# printOrderPagesShort
source: pgs
es: págs

# printOrderTotalOrder
source: Order Total
es: Total del Pedido

# printOrderOrderDate
source: Order date
es: Fecha del pedido

# printOrderNeedHelp
source: Need help?
es: ¿Necesitas ayuda?

# printOrderHelpMessage
source: If you have any questions about your order, contact us.
es: Si tienes alguna pregunta sobre tu pedido, contáctanos.

# printOrderMethod
source: Method
es: Método

# printOrderLocation
source: Location
es: Ubicación

# printOrderType
source: Type
es: Tipo

# printOrderSize
source: Size
es: Tamaño

# printOrderCopies
source: Copies
es: Copias

# printOrderBW
source: B/W
es: B/N

# printOrderPickup
source: Pickup
es: Recoger

# printOrderShipping
source: Shipping
es: Envío

# printOrderStepFiles
source: Files
es: Archivos

# printOrderStepFilesDesc
source: Upload your documents
es: Sube tus documentos

# printOrderStepConfig
source: Configure
es: Configurar

# printOrderStepConfigDesc
source: Print options
es: Opciones de impresión

# printOrderStepConfirm
source: Confirm
es: Confirmar

# printOrderStepConfirmDesc
source: Review order
es: Revisar pedido

# printOrderConfirmTitle
source: Confirm Order
es: Confirmar Pedido

# printOrderConfirmSubtitle
source: Review and complete your information
es: Revisa y completa tu información

# printOrderLoadingConfig
source: Loading configuration...
es: Cargando configuración...

# printOrderErrorLoadingConfig
source: Error loading configuration
es: Error al cargar configuración

# printOrderUploadFiles
source: Upload files
es: Subir archivos

# printOrderUploadFilesDesc
source: Drag or select your documents
es: Arrastra o selecciona tus documentos

# printOrderDropFilesHere
source: Drop your files here!
es: ¡Suelta tus archivos aquí!

# printOrderDragFiles
source: Drag your files
es: Arrastra tus archivos

# printOrderOrClickToSelect
source: or click to select
es: o haz clic para seleccionar

# printOrderSelectFiles
source: Select files
es: Seleccionar archivos

# printOrderImages
source: Images
es: Imágenes

# printOrderUpToMB
source: Up to {mb}MB
es: Hasta {mb}MB

# printOrderNoPagesDetected
source: No pages detected
es: No se detectaron páginas

# printOrderGoBackAndUpload
source: Go back to the previous step and upload your files
es: Regresa al paso anterior y sube tus archivos

# printOrderChooseReceiveOrder
source: Choose how you want to receive your order
es: Elige cómo quieres recibir tu pedido

# printOrderFreeShipping
source: Free shipping!
es: ¡Envío gratis!

# printOrderMakePayment
source: Make Payment
es: Realizar Pago

# printOrderSecurePayment
source: Secure payment with encryption
es: Pago seguro con encriptación

# printOrderFileReady
source: Ready
es: Listo

# printOrderFilesSelected
source: Selected files
es: Archivos seleccionados

# printOrderFilesCount
source: {current} of {max} files
es: {current} de {max} archivos

# printOrderTotalSize
source: Total size
es: Tamaño total

# printOrderAcceptedFormats
source: Accepted formats
es: Formatos aceptados

# printOrderFilesLimit
source: Up to {maxFiles} files • {maxMB}MB per file
es: Hasta {maxFiles} archivos • {maxMB}MB por archivo

# printOrderTipsTitle
source: Tips for best results
es: Tips para mejores resultados

# printOrderTipPdf
source: • Use PDF files for better quality
es: • Usa archivos PDF para mejor calidad

# printOrderTipReadable
source: • Make sure the text is readable
es: • Verifica que el texto sea legible

# printOrderTipResolution
source: • Images should have good resolution
es: • Las imágenes deben tener buena resolución

# printOrderPaymentCard
source: Card
es: Tarjeta

# printOrderPaymentCardDesc
source: Debit or credit
es: Débito o crédito

# printOrderPaymentCash
source: Cash
es: Efectivo

# printOrderPaymentCashDesc
source: Pay when you receive your order
es: Paga al recibir tu pedido

# printOrderPaymentTransfer
source: Transfer
es: Transferencia

# printOrderPaymentTransferDesc
source: Agricultural Bank, BAC, etc.
es: Banco Agrícola, BAC, etc.

# printOrderOrderSummary
source: Order Summary
es: Resumen del Pedido

# printOrderDocuments
source: Documents
es: Documentos

# printOrderTotalPages
source: Total pages
es: Total páginas

# printOrderCostBreakdown
source: Cost Breakdown
es: Desglose de Costos

# printOrderPrintSubtotal
source: Print subtotal
es: Subtotal impresión

# printOrderShippingCost
source: Shipping
es: Envío

# printOrderPaymentMethodLabel
source: Payment method
es: Método de pago

# printOrderEmailConfirmation
source: You will receive an email with your order details
es: Recibirás un correo con los detalles de tu pedido

# printOrderSecurePaymentFull
source: 100% secure and encrypted payment
es: Pago 100% seguro y encriptado

# printOrderCardInfo
source: Card Information
es: Información de Tarjeta

# printOrderAmountToPay
source: Amount to pay
es: Monto a pagar

# printOrderErrorProcessing
source: Error processing order
es: Error al procesar el pedido

# printOrderTermsAccept
source: By continuing, you accept our terms and conditions of service
es: Al continuar, aceptas nuestros términos y condiciones de servicio

# printOrderCashPayment
source: Cash payment
es: Pago en efectivo

# printOrderTransferPayment
source: Transfer payment
es: Pago por transferencia

# printOrderCardPayment
source: Card payment
es: Pago con tarjeta

# printOrderCashPaymentDesc
source: You will pay when you receive your order
es: Pagarás al momento de recibir tu pedido

# printOrderTransferPaymentDesc
source: You will receive instructions by email
es: Recibirás las instrucciones por correo electrónico

# printOrderCardPaymentDesc
source: Pay securely with your card
es: Paga de forma segura con tu tarjeta

# printOrderCardNumber
source: Card Number
es: Número de Tarjeta

# printOrderCardHolder
source: Cardholder Name
es: Nombre del Titular

# printOrderCardHolderHint
source: As it appears on the card
es: Como aparece en la tarjeta

# printOrderExpiry
source: Expiry
es: Vencimiento

# printOrderExpiryHint
source: MM/YY
es: MM/AA

# printOrderNotesHint
source: Any special instructions...
es: Alguna instrucción especial...

# printOrderPhoneOptional
source: Phone (optional)
es: Teléfono (opcional)

# printOrderOrientationPortrait
source: Portrait
es: Vertical

# printOrderOrientationLandscape
source: Landscape
es: Horizontal

# printOrderDoubleSided
source: Double-sided
es: Doble cara

# printOrderBinding
source: Binding
es: Engargolado

# printOrderYes
source: Yes
es: Sí

# printOrderAddress
source: Address
es: Dirección

# printOrderPickupInStore
source: Pick up in store
es: Recoger en tienda

# printOrderHomeDelivery
source: Home delivery
es: Envío a domicilio

# printOrderTypeLabel
source: Type
es: Tipo

# printOrderSizeLabel
source: Size
es: Tamaño

# printOrderOrientationLabel
source: Orientation
es: Orientación

# printOrderCopiesLabel
source: Copies
es: Copias

# printOrderBwLabel
source: B/W
es: Blanco y Negro

# printOrderLetter
source: Letter
es: Carta

# printOrderDoubleLetter
source: Double Letter
es: Doble Carta

# printOrderConfigurePrint
source: Configure Print
es: Configurar Impresión

# printOrderCustomizeOrder
source: Customize your order • {pages} pages
es: Personaliza tu pedido • {pages} páginas

# printOrderPrintType
source: Print Type
es: Tipo de Impresión

# printOrderPaper
source: Paper
es: Papel

# printOrderPaperType
source: Paper Type
es: Tipo de Papel

# printOrderAdditionalOptions
source: Additional Options
es: Opciones Adicionales

# printOrderDoubleSidedPrint
source: Double-sided Print
es: Impresión a Doble Cara

# printOrderSavePaper
source: Save paper
es: Ahorra papel

# printOrderProfessionalPresentation
source: Professional presentation
es: Presentación profesional

# printOrderCostSummary
source: Cost Summary
es: Resumen de Costos

# printOrderPrintingLabel
source: Printing
es: Impresión

# printOrderPerPage
source: per page
es: por página

# printOrderCopy
source: copy
es: copia

# printOrderBondPaper
source: Bond Paper
es: Papel Bond

# printOrderGlossyPaper
source: Glossy Paper
es: Papel Brillante

# printOrderStandard
source: Standard
es: Estándar

# printOrderForImages
source: For images
es: Para imágenes

# printOrderNumberOfCopies
source: Number of Copies
es: Número de Copias

# printOrderMaxCopies
source: Up to 100 copies
es: Máximo 100 copias

# profileMyProfile
source: My Profile
es: Mi Perfil

# profileNoSession
source: No session
es: Sin sesión

# profileEditInfo
source: Edit Information
es: Editar Información

# profilePersonalData
source: Personal data
es: Datos personales

# profileSecurity
source: Security
es: Seguridad

# profilePasswordAccess
source: Password and access
es: Contraseña y accesos

# profileMyAddresses
source: My Addresses
es: Mis Direcciones

# profileManageDeliveries
source: Manage deliveries
es: Gestionar entregas

# profileHelpSupport
source: Help and Support
es: Ayuda y Soporte

# profileHelpCenter
source: Help center
es: Centro de ayuda

# profileAdministrator
source: ADMINISTRATOR
es: ADMINISTRADOR

# profileClientMbe
source: MBE CLIENT
es: CLIENTE MBE

# profilePackages
source: Packages
es: Paquetes

# profilePoints
source: Points
es: Puntos

# profileUpdateSuccess
source: Profile updated successfully
es: Perfil actualizado exitosamente

# profileUpdateError
source: Error updating profile: {error}
es: Error al actualizar perfil: {error}

# profileNameRequired
source: Name is required
es: El nombre es requerido

# profilePhoneInvalid
source: Invalid phone format
es: Formato de teléfono inválido

# profileEmailCannotChange
source: Email cannot be changed from the app.
es: El correo electrónico no se puede cambiar desde la app.

# profileSaveChanges
source: Save Changes
es: Guardar Cambios

# profileCurrentPasswordRequired
source: Current password is required
es: La contraseña actual es requerida

# profileNewPasswordRequired
source: New password is required
es: La nueva contraseña es requerida

# profilePasswordRequirements
source: Password must be at least 8 characters, with uppercase, lowercase and a number
es: La contraseña debe tener al menos 8 caracteres, una mayúscula, una minúscula y un número

# profilePasswordDifferent
source: New password must be different from current
es: La nueva contraseña debe ser diferente a la actual

# profilePasswordUpdatedSuccess
source: Password updated successfully
es: Contraseña actualizada exitosamente

# profilePasswordChangeError
source: Error changing password
es: Error al cambiar contraseña

# profileCurrentPasswordIncorrect
source: Current password is incorrect
es: La contraseña actual es incorrecta

# profileProtectAccount
source: To protect your account, enter your current password.
es: Para proteger tu cuenta, ingresa tu contraseña actual.

# profileCurrentPassword
source: Current Password
es: Contraseña Actual

# profileUpdatePassword
source: Update Password
es: Actualizar Contraseña

# profileDeleteAddressConfirm
source: "{name}" will be permanently deleted.
es: Se eliminará "{name}" permanentemente.

# profileDelete
source: Delete
es: Eliminar

# profileDeleteAddressTitle
source: Delete address?
es: ¿Eliminar dirección?

# profileEdit
source: Edit
es: Editar

# profilePrimary
source: Primary
es: Principal

# profileMakeDefault
source: Set as Primary
es: Hacer Principal

# profileNewAddress
source: New Address
es: Nueva Dirección

# profileNoAddressesRegistered
source: No registered addresses
es: Sin direcciones registradas

# profileAddAddressHint
source: Add an address to receive your packages faster
es: Agrega una dirección para recibir tus paquetes más rápido

# profileAddFirstAddress
source: Add First Address
es: Agregar Primera Dirección

# profileErrorSavingAddress
source: Error saving address: {error}
es: Error al guardar dirección: {error}

# profileAddressNameRequired
source: Address name is required
es: El nombre de la dirección es requerido

# profileDepartmentRequired
source: You must select a department
es: Debes seleccionar un departamento

# profileMunicipalityRequired
source: You must select a municipality
es: Debes seleccionar un municipio

# profileAddressRequired
source: Address is required
es: La dirección es requerida

# profilePhoneRequired
source: Phone is required
es: El teléfono es requerido

# profileEditAddress
source: Edit Address
es: Editar Dirección

# profileCompleteAddressData
source: Complete the data for your shipments
es: Completa los datos para tus envíos

# profileAddressAlias
source: ADDRESS ALIAS
es: ALIAS DE LA DIRECCIÓN

# profileAddressAliasHint
source: e.g. Home, Office, Warehouse...
es: Ej. Casa, Oficina, Bodega...

# profileLocation
source: LOCATION
es: UBICACIÓN

# profileDepartment
source: Department
es: Departamento

# profileMunicipality
source: Municipality
es: Municipio

# profileDistrictOptional
source: District / Subzone (Optional)
es: Distrito / Subzona (Opcional)

# profileDetails
source: DETAILS
es: DETALLES

# profileDetailsHint
source: Street, passage, house number, neighborhood...
es: Calle, pasaje, número de casa, colonia...

# profileReferencesHint
source: References (Black gate, in front of park...)
es: Referencias (Portón negro, frente al parque...)

# profilePhoneLabel
source: PHONE
es: TELÉFONO

# profileMainAddress
source: Primary Address
es: Dirección Principal

# profileUseForShipments
source: Use for my next shipments
es: Usar para mis próximos envíos

# profileSaveAddress
source: Save Address
es: Guardar Dirección

# profileUpdate
source: Update
es: Actualizar

# profileLoading
source: Loading...
es: Cargando...

# profilePersonalInfo
source: Personal Information
es: Información Personal

# profileUpdateNameEmail
source: Update your name and email
es: Actualiza tu nombre y correo electrónico

# profileContactInfo
source: Contact Information
es: Información de Contacto

# profileUpdateContactDocument
source: Update your contact and document information
es: Actualiza tu información de contacto y documento
