Repository: Carranza32/mbe-app
Catalog: lib/l10n/app_*.arb
Languages: es

# profileDocumentDui
source: Unique Identity Document
es: Documento Único de Identidad

# profileDocumentPassport
source: Passport
es: Pasaporte

# profileDocumentLicense
source: Driver's License
es: Licencia de Conducir

# profileSelectType
source: Select a type
es: Selecciona un tipo

# profileFormatDui
source: Format: 12345678-9
es: Formato: 12345678-9

# quoteCalculatorTitle
source: Shipping Calculator
es: Calculadora de Envíos

# quotePackageDetails
source: Package Details
es: Detalles del Paquete

# quoteWeight
source: Weight
es: Peso

# quoteValue
source: Value
es: Valor

# quoteProductType
source: Product Type
es: Tipo de Producto

# quoteErrorCalculating
source: Error calculating: {error}
es: Error al calcular: {error}

source: Quote Generated
es: Cotización Generada

# quoteBasedOnRates
source: Based on current rates
es: Basado en tarifas actuales

# quoteApproxWeight
source: Approximate weight (original: {weight} lbs)
es: Peso aproximado (original: {weight} lbs)

# quoteShippingCost
source: Shipping Cost
es: Costo de Flete

# quoteDeliveryGuarantee
source: Delivery Guarantee
es: Garantía de Entrega

# quoteCustomsTaxes
source: Customs Taxes
es: Impuestos de Aduana

# quoteTotalTaxes
source: Total Taxes
es: Total Impuestos

# quoteCustomsManagement
source: Customs Management
es: Gestión Aduanal

# quoteThirdPartyHandling
source: Third Party Handling
es: Manejo de Terceros

# quoteDiscountApplied
source: Discount applied
es: Descuento aplicado

# quoteTotalToPay
source: Total to Pay:
es: Total a Pagar:

# trendsAdvisor
source: Shopping Advisor
es: Asesor de Compras

# trendsViewAll
source: View all
es: Ver todo

# trendsTrending1
source: Trend #1
es: Tendencia #1

# trendsApproxPrice
source: Approx. Price
es: Precio Aprox.

# trendsSeeOffer
source: See Offer
es: Ver Oferta

# trendsSomethingWrong
source: Something went wrong
es: Algo salió mal

# trendsTryAgain
source: Try again
es: Intentar de nuevo

# adminContextReception
source: Reception
es: Recepción

# adminContextLocation
source: Location
es: Ubicación

# adminContextDelivery
source: Delivery
es: Entrega

# adminContextScan
source: Scan
es: Escanear

# adminReadyToProcess
source: Ready to process
es: Listos para procesar

# adminPackagesScanned
source: Packages Scanned
es: Paquetes Escaneados

# adminReadyToScan
source: Ready to scan
es: Listo para escanear

# adminEnterCodeManually
source: Enter code manually
es: Ingresar código manualmente

# adminScanCode
source: Scan Code
es: Escanear Código

# adminScanWithdrawal
source: Scan withdrawal
es: Escanear retiro

# adminScanAndProcess
source: Scan and process deliveries
es: Escanea y procesa entregas

# adminScanCodeToProcess
source: Scan a code to process
es: Escanea un código para procesar

# adminNoCategory
source: No category
es: Sin categoría

# adminTotalPrice
source: Total Price
es: Precio Total

# adminStoreDelivery
source: Store Pickup
es: Entrega en Tienda

# adminHomeDelivery
source: Home Delivery
es: Entrega a Domicilio

# adminPackageAlreadyScanned
source: This package was already scanned
es: Este paquete ya fue escaneado

# adminPackageTypeMismatch
source: This package is {packageType} type, but the scanned packages are {scannedType} type. You can only scan packages of the same delivery type.
es: Este paquete es de tipo {packageType}, pero los paquetes escaneados son de tipo {scannedType}. Solo puedes escanear paquetes del mismo tipo de entrega.

# adminReceptionTitle
source: Package Reception
es: Recepción de Paquetes

# adminEnterEboxManually
source: Enter ebox code manually
es: Ingresar código ebox manualmente

# adminScanEboxHint
source: Scan the ebox code of a package
es: Escanea el código ebox de un paquete

# adminScanEboxDesc
source: The package will be validated and added to the list
es: El paquete será validado y agregado a la lista

# adminReadyToReceive
source: Ready to receive
es: Listo para recibir

# adminPackageAlreadyReceived
source: This package was already received
es: Este paquete ya fue recepcionado

# adminFinishReception
source: Finish Reception
es: Finalizar Recepción

# adminFinishReceptionMessage
source: Packages will change to "In Store" status and will be assigned a rack automatically.
es: Los paquetes cambiarán a estado "En Tienda" y se les asignará un rack automáticamente.

# adminReceptionSuccess
source: Reception Successful
es: Recepción Exitosa

# adminReceptionProcessError
source: Error processing reception
es: Error al procesar la recepción

# adminConfirm
source: Confirm
es: Confirmar

# adminDispatchHome
source: Dispatch Home Delivery
es: Despachar a Domicilio

# adminShippingProvider
source: Shipping Provider
es: Proveedor de Envíos

# adminConfirmDispatch
source: Confirm Dispatch
es: Confirmar Despacho

# adminProcessing
source: Processing...
es: Procesando...

# adminScanPackagesToDispatch
source: Scan packages to dispatch
es: Escanea paquetes para despachar

# adminGeneralSummary
source: General Summary
es: Resumen General

# adminPackages
source: Packages
es: Paquetes

# adminProducts
source: Products
es: Productos

# adminWeight
source: Weight
es: Peso

# adminTotalWeight
source: Total Weight
es: Peso Total

# adminProvider
source: Provider
es: Proveedor

# adminTransport
source: Transport
es: Transporte

# adminPackageTotal
source: Package Total
es: Total del Paquete

# adminSelectProvider
source: Select a provider
es: Selecciona un proveedor

# adminScanAtLeastOne
source: You must scan at least one package
es: Debes escanear al menos un paquete

# adminDispatchError
source: Error processing dispatch
es: Error al procesar el despacho

# adminDispatchSuccess
source: Dispatch created successfully!
es: ¡Despacho creado exitosamente!

# adminErrorLoadingProviders
source: Error loading providers
es: Error cargando proveedores

# adminRequired
source: Required
es: Requerido

# adminProcessDelivery
source: Process Delivery
es: Procesar Entrega

# adminConfirmDelivery
source: Confirm Delivery
es: Confirmar Entrega

# adminCaptureSignature
source: You must capture the customer signature
es: Debes capturar la firma del cliente

# adminSelectRecipient
source: You must select who receives the package
es: Debes seleccionar quién recibe el paquete

# adminEnterManagerName
source: You must enter the manager name
es: Debes ingresar el nombre del encargado

# adminSignatureError
source: Error capturing signature
es: Error al capturar la firma

# adminDeliveryError
source: Error processing delivery
es: Error al procesar la entrega

# adminEditLocation
source: Edit Location
es: Editar Ubicación

# adminWarehouseLocation
source: Warehouse Location
es: Ubicación en Bodega

# adminSelectRackSegment
source: Select a rack to see available segments
es: Selecciona un rack para ver los segmentos disponibles

# adminScanningRack
source: Scanning Rack
es: Escaneando Rack

# adminScanningSegment
source: Scanning Segment
es: Escaneando Segmento

# adminLocationUpdateMessage
source: Location will be updated immediately after saving
es: La ubicación se actualizará inmediatamente después de guardar

# adminSaving
source: Saving...
es: Guardando...

# adminSaveLocation
source: Save Location
es: Guardar Ubicación

# adminSelectRack
source: Select Rack
es: Seleccionar Rack

# adminScanRack
source: Scan Rack
es: Escanear Rack

# adminSelectSegment
source: Select Segment
es: Seleccionar Segmento

# adminOccupied
source: Occupied
es: Ocupado

# adminScanSegment
source: Scan Segment
es: Escanear Segmento

# adminLocationUpdated
source: Location updated successfully
es: Ubicación actualizada correctamente

# adminLockerPickup
source: Store pickup
es: Retiro en tienda

# adminCreatePickup
source: Create pickup
es: Crear retiro

# adminCreating
source: Creating...
es: Creando...

# adminErrorLoadingStores
source: Error loading stores
es: Error al cargar tiendas

# adminSelectStoreFirst
source: Select a store first
es: Selecciona una tienda primero

# adminPending
source: Pending
es: Pendientes

# adminDelivered
source: Delivered
es: Entregados

# adminScanQR
source: Scan QR
es: Escanear QR

# adminSearch
source: Search
es: Buscar

# adminReintentar
source: Retry
es: Reintentar

# adminNoPendingPickups
source: No pending pickups
es: No hay retiros pendientes

# adminNoDeliveries
source: No deliveries registered
es: No hay entregas registradas

# adminPhysicalLocker
source: Physical locker
es: Casillero físico

# adminLockerAccount
source: Locker account
es: Cuenta de casillero

# adminType
source: Type
es: Tipo

# adminPackage
source: Package
es: Paquete

# adminCorrespondence
source: Correspondence
es: Correspondencia

# adminScanQRPasteToken
source: Scan QR or paste token
es: Escanear QR o pegar token

# adminPasteTokenHint
source: Paste token or email URL
es: Pegar token o URL del correo

# adminSearching
source: Searching...
es: Buscando...

# adminContinue
source: Continue
es: Continuar

# adminDeliveryRegistered
source: Delivery registered successfully
es: Entrega registrada correctamente

# adminPickupDetail
source: Pickup detail
es: Detalle del retiro

# adminClient
source: Client
es: Cliente

# adminPieces
source: Pieces
es: Piezas

# adminPinExpires
source: PIN expires
es: PIN vence

# adminDelivering
source: Registering...
es: Registrando...

# adminDeliver
source: Deliver
es: Entregar

# adminSearchLockerCode
source: Enter locker code or DUI and press Search
es: Escribe código de casillero o DUI y pulsa Buscar

# adminNoStoresAssigned
source: You have no stores assigned
es: No tienes tiendas asignadas

# adminErrorLoadingLockers
source: Error loading lockers
es: Error al cargar casilleros

# adminErrorLoadingAccounts
source: Error loading accounts
es: Error al cargar cuentas

# adminCompleteStoreLockerAccount
source: Complete store, locker and account
es: Completa tienda, casillero y cuenta

# adminNoStoresAvailable
source: No stores available
es: No hay tiendas disponibles

# adminPinClient
source: Client PIN (6 digits)
es: PIN del cliente (6 dígitos)

# adminEnterPin6
source: Enter the 6-digit PIN
es: Ingresa los 6 dígitos del PIN

# adminDeliveryRegisterError
source: Error registering delivery. Try again.
es: Error al registrar la entrega. Intenta de nuevo.
