Repository: Carranza32/mbe-app
Catalog: lib/l10n/app_*.arb
Languages: es

# authWelcomeBack
source: Welcome back
es: Bienvenido de nuevo

# authSignInToContinue
source: Sign in to continue
es: Inicia sesión para continuar

# authHasAccountMessage
source: You already have an account. You can sign in with your password. If you don't remember it, you can recover it below.
es: Ya tienes cuenta. Puedes iniciar sesión con tu contraseña. Si no la recuerdas, puedes recuperarla abajo.

# authEmail
source: Email
es: Correo Electrónico

# authPassword
source: Password
es: Contraseña

# authSignIn
source: Sign In
es: Iniciar Sesión

# authCompleteAllFields
source: Please fill in all fields
es: Completa todos los campos

# authForgotPassword
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# authRecover
source: Recover
es: Recuperar

# authNoAccount
source: Don't have an account?
es: ¿No tienes una cuenta?

# authActivateAccount
source: Activate account
es: Activar cuenta

# welcomeTitle
source: Welcome
es: Bienvenido

# welcomeSubtitle
source: Enter your email to get started
es: Ingresa tu correo para comenzar

# authContinue
source: Continue
es: Continuar

# authAlreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta?

# forgotPasswordTitle
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# forgotPasswordSubtitle
source: Don't worry, we'll send you a link to reset your password
es: No te preocupes, te enviaremos un enlace para restablecer tu contraseña

# authSendRecoveryLink
source: Send recovery link
es: Enviar enlace de recuperación

# authRememberedPassword
source: Remember your password?
es: ¿Recordaste tu contraseña?

source: Email sent
es: Correo enviado

# emailSentMessage
source: We've sent a recovery link to:
es: Hemos enviado un enlace de recuperación a:

# emailSentInstructions
source: Please check your email and click the link to reset your password.
es: Por favor, revisa tu correo y haz clic en el enlace para restablecer tu contraseña.

# authUnderstood
source: Understood
es: Entendido

# resetPasswordTitle
source: Reset password
es: Restablecer contraseña

# resetPasswordSubtitle
source: Enter your new password
es: Ingresa tu nueva contraseña

source: New Password
es: Nueva Contraseña

source: Confirm New Password
es: Confirmar Nueva Contraseña

# authResetPassword
source: Reset password
es: Restablecer contraseña

# passwordResetSuccess
source: Password reset successfully
es: Contraseña restablecida

# passwordResetSuccessMessage
source: Your password has been successfully reset. You can now sign in with your new password.
es: Tu contraseña ha sido restablecida exitosamente. Ahora puedes iniciar sesión con tu nueva contraseña.

source: Go to sign in
es: Ir a iniciar sesión

# verifyEmailTitle
source: Verify your email
es: Verifica tu correo

# verifyEmailCodeSent
source: We've sent a 6-digit verification code to:
es: Hemos enviado un código de verificación de 6 dígitos a:

source: Verify code
es: Verificar código

# codeResendQuestion
source: Didn't receive the code?
es: ¿No recibiste el código?

# authResend
source: Resend
es: Reenviar

# emailVerifiedSuccess
source: Email verified successfully!
es: ¡Correo verificado exitosamente!

# otpEnterCode
source: Enter the 6-digit code sent to:
es: Ingresa el código de 6 dígitos enviado a:

# authVerify
source: Verify
es: Verificar

# authResendCodeQuestion
source: Didn't receive the code? Resend
es: ¿No recibiste el código? Reenviar

# invalidCodeError
source: Invalid code. Please try again.
es: Código inválido. Por favor, intenta de nuevo.

# codeResentSuccess
source: Code resent to your email
es: Código reenviado a tu correo

# resendCodeError
source: Error resending code
es: Error al reenviar el código

# codeDetectedClipboard
source: Code detected from clipboard
es: Código detectado del portapapeles

# enterSixDigits
source: Please enter a 6-digit code
es: Ingresa un código de 6 dígitos

# enterSixDigitsError
source: Enter a 6-digit code
es: Por favor, ingresa un código de 6 dígitos

# createPasswordTitle
source: Create your password
es: Crea tu contraseña

# createPasswordSubtitle
source: To secure your account, set a new password
es: Para asegurar tu cuenta, define una contraseña nueva

source: Confirm Password
es: Confirmar Contraseña

source: Finish Registration
es: Finalizar Registro

# passwordCreatedSuccess
source: Password created. You can now sign in.
es: Contraseña creada. Ya puedes iniciar sesión.

source: Passwords do not match
es: Las contraseñas no coinciden

# errorCreatingPassword
source: Error creating password. Please try again.
es: Error al crear contraseña. Intenta de nuevo.

# minEightChars
source: At least 8 characters
es: Mínimo 8 caracteres

# includeUppercase
source: Include an uppercase letter
es: Incluye una mayúscula

# includeLowercase
source: Include a lowercase letter
es: Incluye una minúscula

# includeNumber
source: Include a number
es: Incluye un número

# activateAccountTitle
source: Activate your account
es: Activar tu cuenta

# activateAccountTitleAnAccount
source: Activate an account
es: Activar una cuenta

# activateAccountSubtitle
source: Join Mail Boxes Etc. and enjoy our services
es: Únete a Mail Boxes Etc. y disfruta de nuestros servicios

# activationMessageDefault
source: Hello! We see you already have an account with us. Let's activate it.
es: ¡Hola! Vemos que ya tienes una cuenta con nosotros. Vamos a activarla.

# registerInfo
source: Registration Information
es: Información de Registro

source: Verification Code
es: Código de Verificación

# verificationCodeHint
source: Enter the 6-digit code we sent to your email
es: Ingresa el código de 6 dígitos que enviamos a tu correo

source: Full Name
es: Nombre Completo

# fullNameHint
source: First and last name
es: Nombre y apellido

source: Phone
es: Teléfono

source: Locker
es: Casillero

# lockerEboxNote
source: Remember you need to register in ebox to get your locker code.
es: Recuerda que tienes que registrarte en ebox para poder tener tu código de casillero.

# passwordHint
source: Minimum 8 characters, include uppercase, lowercase and numbers
es: Mínimo 8 caracteres, incluye mayúsculas, minúsculas y números

source: Passwords match
es: Las contraseñas coinciden

source: Activate my account
es: Activar mi cuenta

# accountActivatedSuccess
source: Account activated successfully
es: Cuenta activada exitosamente

# accountCreatedSuccess
source: Account created successfully
es: Cuenta creada exitosamente

# termsAndPrivacy
source: By creating an account, you accept our Terms of Service and Privacy Policy
es: Al crear una cuenta, aceptas nuestros Términos de Servicio y Política de Privacidad

# errorCreatingAccount
source: An error occurred while creating your account. Please try again.
es: Ocurrió un error al crear tu cuenta. Por favor, intenta de nuevo.

# registerStepInfo
source: Information
es: Información

# registerStepLocation
source: Location
es: Ubicación

# registerStepContact
source: Contact
es: Contacto

# registerStepSecurity
source: Security
es: Seguridad

source: Unknown error
es: Error desconocido

# completeRequiredFields
source: Please complete all required fields
es: Por favor completa todos los campos requeridos

source: User not found
es: Usuario no encontrado

# documentInvalid
source: Invalid document number
es: Número de documento inválido

# phoneInvalid
source: Invalid phone
es: Teléfono inválido

# legacyWelcomeMessage
source: Hello! We see you already have a locker with us. Let's activate your digital account.
es: ¡Hola! Vemos que ya tienes un casillero con nosotros. Vamos a activar tu cuenta digital.

# newUserWelcomeMessage
source: You seem to be new. Let's create your account.
es: Parece que eres nuevo. Vamos a crear tu cuenta.

# biometricWelcomeBack
source: Welcome back
es: Bienvenido de nuevo

# biometricSignInSubtitle
source: Sign in with your fingerprint or Face ID
es: Inicia sesión con tu huella o Face ID

# biometricNotAvailable
source: Biometric authentication is not available on this device
es: La autenticación biométrica no está disponible en este dispositivo

# authSignInWithEmail
source: Sign in with email
es: Iniciar sesión con email

# authLogout
source: Log out
es: Cerrar sesión

# authCancel
source: Cancel
es: Cancelar

# authLogoutConfirm
source: Are you sure you want to log out?
es: ¿Estás seguro de que deseas cerrar sesión?

# biometricTouchFaceId
source: Tap to use Face ID
es: Toca para usar Face ID

# biometricTouchFingerprint
source: Tap to use fingerprint
es: Toca para usar huella

# biometricTouchIris
source: Tap to use iris
es: Toca para usar iris

# biometricTouchAuthenticate
source: Tap to authenticate
es: Toca para autenticar

# authBiometricReason
source: Please authenticate to access your MBE account
es: Por favor, autentícate para acceder a tu cuenta de MBE

# authCancelled
source: Authentication cancelled
es: Autenticación cancelada

# authUser
source: User
es: Usuario

# verificationPendingTitle
source: Verification Pending
es: Verificación Pendiente

# verificationPendingMessage
source: Your account is being reviewed by our administration team.
es: Tu cuenta está siendo revisada por nuestro equipo de administración.

# verificationPendingDetail
source: To create print orders or pre-alerts, an administrator needs to verify your account first.
es: Para crear órdenes de impresión o pre-alertas, necesitas que un administrador verifique tu cuenta primero.

# whatWeAreVerifying
source: What are we verifying?
es: ¿Qué estamos verificando?

# verificationDetail
source: We are reviewing your email and locker code to ensure everything is correct.
es: Estamos revisando tu correo electrónico y código de casillero para asegurar que todo esté correcto.

source: Email notification
es: Notificación por correo

# emailNotificationDetail
source: You will receive an email when your account has been verified.
es: Recibirás un correo electrónico cuando tu cuenta haya sido verificada.

# completeProfileAndStatus
source: Complete Profile and View Status
es: Completar Perfil y Ver Estado

source: Account Under Review
es: Cuenta en Revisión

# accountUnderReviewMessage
source: We are reviewing your information. In the meantime, complete your profile to speed up the process.
es: Estamos revisando tu información. Mientras tanto, completa tu perfil para acelerar el proceso.

# reviewingEmailLocker
source: We are reviewing your email and locker code.
es: Estamos revisando tu correo electrónico y código de casillero.

source: Complete Your Profile
es: Completa tu Perfil

# completeProfileSubtitle
source: Provide the following information to complete your registration
es: Proporciona la siguiente información para completar tu registro

source: Home Phone (Optional)
es: Teléfono de Casa (Opcional)

source: Document Type
es: Tipo de Documento

source: Select document type
es: Selecciona el tipo de documento

# errorLoadingDocuments
source: Error loading document types
es: Error al cargar tipos de documento

source: Document Number
es: Número de Documento

source: Addresses
es: Direcciones

source: New address
es: Nueva dirección

source: Your Addresses
es: Tus Direcciones

# noAddresses
source: You have no addresses
es: No tienes direcciones

# addAddressHint
source: Add an address for your shipments
es: Agrega una dirección para tus envíos

source: Error loading addresses
es: Error al cargar direcciones

source: Save profile
es: Guardar perfil

# defaultAddress
source: Default
es: Predeterminada

# activateAccountScreenTitle
source: Activate your account
es: Activar tu cuenta

# activateAccountScreenSubtitle
source: Enter your email to check if you already have an account
es: Ingresa tu correo electrónico para verificar si ya tienes una cuenta

# haveLockerCode
source: Do you have a locker code?
es: ¿Tienes un código de casillero?

source: Locker Code
es: Código de Casillero

source: Email already registered
es: Correo ya registrado

# emailAlreadyRegisteredMessage
source: This email is already registered in our system.
es: Este correo electrónico ya está registrado en nuestro sistema.

# forgotPasswordHint
source: If you forgot your password, you can recover it from the sign in screen.
es: Si olvidaste tu contraseña, puedes recuperarla desde la pantalla de inicio de sesión.

# verificationCodeSentTo
source: Verification code sent to {email}
es: Código de verificación enviado a {email}

# errorVerifyingEmail
source: An error occurred while verifying the email. Please try again.
es: Ocurrió un error al verificar el correo. Por favor, intenta de nuevo.

# settingsLanguage
source: Language
es: Idioma

# settingsLanguageSubtitle
source: Spanish (ES)
es: Español (ES)

# settingsAccount
source: Account Settings
es: Configuración de Cuenta

# pleaseEnterEmail
source: Please enter your email
es: Por favor, ingresa tu correo electrónico

# errorSendingLink
source: An error occurred while sending the link. Please try again.
es: Ocurrió un error al enviar el enlace. Por favor, intenta de nuevo.

# completeFieldsCorrectly
source: Please complete all fields correctly
es: Por favor, completa todos los campos correctamente

# errorResettingPassword
source: An error occurred while resetting the password. Please try again.
es: Ocurrió un error al restablecer la contraseña. Por favor, intenta de nuevo.

source: Valid
es: Válido

source: Loading document types...
es: Cargando tipos de documento...

# addressSavedSuccess
source: Address "{name}" saved successfully
es: Dirección "{name}" guardada exitosamente

# addressUpdatedSuccess
source: Address "{name}" updated successfully
es: Dirección "{name}" actualizada exitosamente

source: Error saving address
es: Error al guardar dirección

source: Error updating address
es: Error al actualizar dirección

# profileSavedSuccess
source: Profile saved successfully
es: Perfil guardado exitosamente

source: Error saving profile
es: Error al guardar perfil

# homeGoodMorning
source: Good morning,
es: Buenos días,

# homeGoodAfternoon
source: Good afternoon,
es: Buenas tardes,

# homeGoodEvening
source: Good evening,
es: Buenas noches,

# homeAdminPanel
source: Admin Panel
es: Panel de Admin

# homeAdministrator
source: Administrator
es: Administrador

# homeYourLocker
source: YOUR LOCKER
es: TU CASILLERO

# homeAddressCopied
source: Address copied to clipboard
es: Dirección copiada al portapapeles

# homeInWarehouse
source: In Warehouse
es: En Bodega

# homeInTransit
source: In Transit
es: En Camino

# homeAvailable
source: Available
es: Disponibles

# homeWhatDoYouWant
source: What would you like to do today?
es: ¿Qué quieres hacer hoy?

# homePreAlert
source: Pre-alert
es: Pre-alertar

# homePreAlertSubtitle
source: Notify your purchase
es: Notifica tu compra

# homeQuote
source: Quote
es: Cotizar

# homeQuoteSubtitle
source: Calculate costs
es: Calcula costos

# homeMyPackages
source: My Packages
es: Mis Paquetes

# homeMyPackagesSubtitle
source: View inventory
es: Ver inventario

# homeTrack
source: Track
es: Rastrear

# homeSearchOffers
source: Search offers
es: Buscar ofertas

# homeSearchOffersSubtitle
source: Explore trends
es: Explorar tendencias

# homePrintOrdersSubtitle
source: Print orders
es: Impresiones

# homeNavHome
source: Home
es: Inicio

# homeNavPackages
source: Packages
es: Paquetes

# homeNavRetrieval
source: Retrieval
es: Retiro

# homeNavSearch
source: Search
es: Buscar

# homeNavProfile
source: Profile
es: Perfil

# homeNavPrint
source: Print
es: Impresiones

# homeNavPreAlert
source: Pre-alert
es: Pre-alertar

# homeNavQuote
source: Quote
es: Cotizar

# homeNavTrends
source: Trends
es: Tendencias

# homeLockerRegistrationTitle
source: MBE Locker Registration
es: Registro de casillero MBE

# homeCreateLocker
source: Create locker
es: Crear casillero

# homeNoLocker
source: You don't have a locker with us
es: No tienes casillero con nosotros

# homeNoLockerSubtitle
source: Create one to receive your purchases in Miami and ship them to El Salvador.
es: Crea uno para recibir tus compras en Miami y enviarlas a El Salvador.

# homeOpenLink
source: Open link
es: Abrir enlace

# trendsTitle
source: Explore Trends
es: Explorar Tendencias

# trendsSubtitle
source: Most searched products this week
es: Los productos más buscados de la semana

# adminQuickOps
source: Quick Operations
es: Operaciones Rápidas

# adminReception
source: Reception
es: Recepción

# adminReceptionSubtitle
source: Scan incoming
es: Escanear entrada

# adminDelivery
source: Delivery
es: Entrega

# adminDeliverySubtitle
source: Correspondence
es: Correspondencia

# adminInventory
source: Inventory
es: Inventario

# adminInventorySubtitle
source: Query warehouse
es: Consultar bodega

# adminReports
source: Reports
es: Reportes

# adminReportsSubtitle
source: Statistics
es: Estadísticas

# adminNeedsAttention
source: Needs Attention
es: Requieren Atención

# adminViewAll
source: View all
es: Ver todos

# adminAlertedToday
source: Alerted Today
es: Alertados Hoy

# adminReceivedToday
source: Received Today
es: Recibidos Hoy

# adminInWarehouse
source: In Warehouse
es: En Bodega

# adminDepartures
source: Departures
es: Salidas

# adminSearchPlaceholder
source: Search tracking, customer, locker...
es: Buscar tracking, cliente, casillero...

# adminPackageNoInvoice
source: Package without Invoice
es: Paquete sin Factura

# adminTrackingPlaceholder
source: Tracking: 1Z999... • 2h ago
es: Tracking: 1Z999... • Hace 2h

# drawerHello
source: Hello! {name}
es: ¡Hola! {name}

# drawerTierStandard
source: Standard
es: Estándar

# drawerSectionMain
source: Main
es: Principal

# drawerSectionServices
source: Services
es: Servicios

# drawerSectionAccount
source: Account
es: Cuenta

# drawerSectionHelp
source: Help
es: Ayuda

# drawerSectionAdmin
source: Administration
es: Administración

# drawerProfile
source: Profile
es: Perfil

# drawerAddresses
source: Registered addresses
es: Direcciones registradas

# drawerPromoCodes
source: Promotional codes
es: Códigos promocionales

# drawerRestrictedMaterials
source: Restricted materials
es: Materiales restringidos

# drawerTrackPackage
source: Track package
es: Rastrear paquete

# drawerPreAlert
source: Pre-alert
es: Pre-alertar

# drawerQuote
source: Quote
es: Cotizar

# drawerYourPackages
source: Your packages
es: Tus paquetes

# drawerPaymentMethods
source: Payment methods
es: Métodos de pago

# drawerPremiumPlans
source: Premium Plans
es: Planes Premium

# drawerNotifications
source: Notifications
es: Notificaciones

# drawerHistory
source: History
es: Historial

# drawerNew
source: New
es: Nuevo

# drawerFaq
source: FAQ
es: Preguntas frecuentes

# drawerContact
source: Contact us
es: Contáctanos

# drawerTerms
source: Terms and Conditions
es: Términos y Condiciones

# drawerLogout
source: Log out
es: Cerrar sesión

# drawerLogoutConfirm
source: Log out?
es: ¿Cerrar sesión?

# drawerLogoutMessage
source: You will need to enter your credentials again.
es: Tendrás que ingresar tus credenciales nuevamente.

# drawerVersion
source: Version {version}
es: Versión {version}

# preAlertNewTitle
source: New Pre-alert
es: Nueva Prealerta

# preAlertNewSubtitle
source: Complete the information to register your package
es: Completa la información para registrar tu paquete

# preAlertInvoiceNumber
source: Invoice Number
es: Número de Factura

# preAlertInvoiceHint
source: e.g. 112-9876543-1234567
es: Ej: 112-9876543-1234567

# preAlertProductsInPackage
source: Products in package
es: Productos dentro del paquete

# preAlertAddProduct
source: Add Product
es: Agregar Producto

# preAlertCategoryNote
source: * Make sure to enter the correct category for your package, as it may cause delays in processing.
es: * Asegúrate de ingresar la categoría correcta de tu paquete, ya que pueden causar retrasos al procesarlo.

# preAlertCreate
source: Create Pre-alert
es: Crear Prealerta

# preAlertCreatedSuccess
source: Pre-alert created!
es: ¡Prealerta creada!

# preAlertCreatedMessage
source: Your pre-alert has been registered successfully
es: Tu prealerta ha sido registrada exitosamente

# preAlertAccept
source: Accept
es: Aceptar

# preAlertCreateError
source: Error creating pre-alert
es: Error al crear la prealerta

# preAlertStoreWhereBought
source: Store where you bought the product
es: Tienda donde compraste el producto

# preAlertSelectStore
source: Select a store
es: Selecciona una tienda

# preAlertSearchStore
source: Search store...
es: Buscar tienda...

# preAlertInvoiceForPurchase
source: Invoice for this purchase
es: Factura para esta compra

# preAlertInvoiceUploadHint
source: Upload your invoice above with "AI Autocomplete". The same file will be sent with the pre-alert.
es: Sube tu factura arriba con "Autocompletar con IA". El mismo archivo se enviará con la prealerta.

# preAlertMyPreAlerts
source: My Pre-alerts
es: Mis Prealertas

# preAlertNewPreAlert
source: New Pre-alert
es: Nueva Pre-alerta

# preAlertRetry
source: Retry
es: Reintentar

# preAlertStore
source: STORE
es: TIENDA

# preAlertDate
source: DATE
es: FECHA

# preAlertProducts
source: PRODUCTS
es: PRODUCTOS

# preAlertNoAddress
source: No address
es: Sin dirección

# preAlertActionRequired
source: Action Required
es: Acción Requerida

# preAlertActionRequiredMessage
source: You have packages in store that require selecting delivery method
es: Tienes paquetes en tienda que requieren seleccionar método de entrega

# preAlertNoPreAlerts
source: You have no pre-alerts
es: No tienes pre-alertas

# preAlertCreateFirst
source: Create your first package pre-alert
es: Crea tu primera pre-alerta de paquete

# preAlertDetailTitle
source: Pre-alert Detail
es: Detalle de Pre-alerta

# preAlertDetailLoadError
source: Could not load detail
es: No se pudo cargar el detalle

# preAlertGeneralInfo
source: General information
es: Información general

# preAlertStoreLabel
source: Store
es: Tienda

# preAlertStatus
source: Status
es: Estado

# preAlertClient
source: Client
es: Cliente

# preAlertLocker
source: Locker
es: Casillero

# preAlertProductsSection
source: Products
es: Productos

# preAlertProductCount
source: {count} product(s)
es: {count} producto(s)

# preAlertNoProducts
source: No products
es: Sin productos

# preAlertProductDefault
source: Product
es: Producto

# preAlertContact
source: Contact
es: Contacto

# preAlertNoContactData
source: No contact data
es: Sin datos de contacto

# preAlertDelivery
source: Delivery
es: Entrega

# preAlertName
source: Name
es: Nombre

# preAlertPhone
source: Phone
es: Teléfono

# preAlertAddress
source: Address
es: Dirección

# preAlertNoDeliveryAddress
source: No delivery address
es: Sin dirección de entrega

# preAlertChangeHistory
source: Change history
es: Historial de cambios

# preAlertDocument
source: Document
es: Documento

# preAlertPayment
source: Payment
es: Pago

# preAlertPaid
source: Paid
es: Pagado

# preAlertPending
source: Pending
es: Pendiente

# preAlertLastPayment
source: Last payment
es: Último pago

# preAlertCompleteTitle
source: Complete Pre-alert
es: Completar Pre-alerta

# preAlertStepOf
source: Step {current} of {total}
es: Paso {current} de {total}

# preAlertViewPromotions
source: View promotions
es: Ver promociones

# preAlertDeliveryMethod
source: Delivery method
es: Método de entrega

# preAlertChooseDeliverySubtitle
source: Choose how you want to receive your package
es: Elige cómo quieres recibir tu paquete

# preAlertContactInfo
source: Contact information
es: Información de contacto

# preAlertCompletePayment
source: Complete your payment
es: Completa tu pago

# preAlertSelectDeliveryMethod
source: Please select a delivery method
es: Por favor selecciona un método de entrega

# preAlertCompleteRequiredFields
source: Please complete all required fields
es: Por favor completa todos los campos requeridos

# preAlertCompletePaymentInfo
source: Please complete payment information
es: Por favor completa la información de pago
